Libreria/app/views/appointments/_form.html.erb

    <%= f.label "Seleciona libro" %><br>
    <%= f.collection_select :pet_id, Pet.order(:name),:id,:name, include_blank: true %>
---
SELECT "pets".* FROM "pets"  ORDER BY "pets"."name" ASC

    <%= f.label "Seleciona bibliotecario"%><br>
    <%= f.collection_select :doctor_id, Doctor.order(:name),:id,:name, include_blank: true %>
---
SELECT "doctors".* FROM "doctors"  ORDER BY "doctors"."name" ASC